


## 판다스 (Pandas)

- 핵심객체는 DataFrame이다
- 데이타프레임은 2차원 데이터 구조체로 넘파이보다 편리하게 데이타 핸들링한다.
- R 언어의 데이타 프레임과 비슷하고 많이 사용된다


#### DataFrame 에서 데이타 필터링 ( 추출하기 )

0. 맨처음에는

    + df[2] : 2행의 데이타 추출
    + df['A'] : A열(컬럼) 데이타 추출
    
    + df[n:m] : n번째부터 m-1번째까지의 행 추출
        
    ` 행과 열을 섞어서 추출함.
    ` 판다스를 만든 사람이 쓴 책의 번역서를 보면 이 부분을 후회한다고 나옴
      

1. 열(컬럼) 추출

    + df.컬럼명
    + df['컬럼명']
       
    
2. 행 추출

    + df.loc[] : 인덱스(순서)와 명칭으로 추출
    + df.iloc[] : 인덱스(순서)로 추출
    + df.ix[] : 명치 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (* 그러나 곧 사라질 예정 )

    [참고] 
    
    - 위 3 연산자는 노련한 개발자들도 혼동하기에, 일반적으로 하나만 선택해서 사용하는 것을 권장한단다
    - 넘파이와 유사한 부분으로 더우 혼동하기 쉽다
    - 판다스의 DataFrame와 Series에서도 다른이 있어서 주의해야 한다
    
    
3. 행과 열에서 추출
    
    + df.loc[2, 3] : 2 행의 3열 데이타
    + df.loc[1:3, 2:4] : 1부터 3행전까지의 행에서 2부터 4전까지의 열의 데이타

한번 쭉 훑어보기

In [1]:
import pandas as pd

# 데이타 프레임 자료 생성
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }
df = pd.DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [2]:
# 인덱스만 추출
print(df.index)
# 데이터값들 추출
print(df.values)
# 키값 추출
print(df.keys())

# 컬럼명(DataFrame 은 키보다 컬럼으로 권장)
df.columns

RangeIndex(start=0, stop=3, step=1)
[['홍길동' 22 '컴공']
 ['박길동' 33 '국어']
 ['김길동' 44 '산업']]
Index(['name', 'age', 'dept'], dtype='object')

Index(['name', 'age', 'dept'], dtype='object')

In [3]:
df3 =pd.DataFrame(mydata , index=['일','이','삼'])
df3

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업

In [4]:
# 컬럼 추가
df['gender']=['여자','님지','여자']
df
df['dept']=['수학','통계','산수']
df

  name  age dept gender
0  홍길동   22   수학     여자
1  박길동   33   통계     님지
2  김길동   44   산수     여자

In [5]:
# 행 추가
df.loc[3]=['맹길동',55,'컴공','남자']
df

  name  age dept gender
0  홍길동   22   수학     여자
1  박길동   33   통계     님지
2  김길동   44   산수     여자
3  맹길동   55   컴공     남자

In [6]:
# 행 추가
df.loc[7]=['이길동',77,'컴공','여자']
df

  name  age dept gender
0  홍길동   22   수학     여자
1  박길동   33   통계     님지
2  김길동   44   산수     여자
3  맹길동   55   컴공     남자
7  이길동   77   컴공     여자

In [7]:
df.loc[5] = ['배길동',55,'컴공','남자']
df

  name  age dept gender
0  홍길동   22   수학     여자
1  박길동   33   통계     님지
2  김길동   44   산수     여자
3  맹길동   55   컴공     남자
7  이길동   77   컴공     여자
5  배길동   55   컴공     남자

### 컬럼 추가, 행 추가

In [8]:
# 컬럼 추가

In [9]:
# 행 추가

In [10]:
# 행 추가

### 변경

In [11]:
# 인덱스순서를 변경하려면 -> 인덱스는 우선 DataFrame이 있는 상태에서 변경해야 한다
df = df.reindex(index=[7,0,2,5,1])
df

  name  age dept gender
7  이길동   77   컴공     여자
0  홍길동   22   수학     여자
2  김길동   44   산수     여자
5  배길동   55   컴공     남자
1  박길동   33   통계     님지

In [12]:
# 컬럼연산
df['age+10'] = df['age'] + 10
df

  name  age dept gender  age+10
7  이길동   77   컴공     여자      87
0  홍길동   22   수학     여자      32
2  김길동   44   산수     여자      54
5  배길동   55   컴공     남자      65
1  박길동   33   통계     님지      43

In [13]:
# 5 행에 'dept'열의 값을 '인문'으로 변경
df.loc[5,'dept']='인문'
df

  name  age dept gender  age+10
7  이길동   77   컴공     여자      87
0  홍길동   22   수학     여자      32
2  김길동   44   산수     여자      54
5  배길동   55   인문     남자      65
1  박길동   33   통계     님지      43

###  컬럼 속성 추출

In [14]:
# 컬럼 속성 추출
df.dept

df['dept']

7    컴공
0    수학
2    산수
5    인문
1    통계
Name: dept, dtype: object

In [15]:
# 특정 컬럼의 특정행 추출 -> 즉 특정셀 추출
df['dept'][2]
df.dept[2]

'산수'

In [16]:
# 30세 이상의 레코드 겁색
df[df['age']>=30]

  name  age dept gender  age+10
7  이길동   77   컴공     여자      87
2  김길동   44   산수     여자      54
5  배길동   55   인문     남자      65
1  박길동   33   통계     님지      43

In [17]:
# 박길동을 박가로 변경하려면?
print(df.loc[1])
print('-'*50)
print(df.iloc[1])

name      박길동
age        33
dept       통계
gender     님지
age+10     43
Name: 1, dtype: object
--------------------------------------------------
name      홍길동
age        22
dept       수학
gender     여자
age+10     32
Name: 0, dtype: object

## 데이타 필터링

- 넘파이와 유사한 부분으로 더우 혼동하기 쉽다

- 판다스의 DataFrame와 Series에서도 다른이 있어서 주의해야 한다


1. loc[] : 인덱스와 명칭으로 추출

2. iloc[] : 인덱스로 추출

3. ix[] : 명치 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (*  그러나 곧 사라질 예정 )


위 3 연산자는 노련한 개발자들도 혼동하기에,
일반적으로 하나만 선택해서 사용하는 것을 권장한단다

In [18]:
print(df.iloc[1,2])
print(df.loc[1,'dept'])

수학
통계

In [19]:
# 명칭기반 인덱스 : 문자열이 인덱스인 경우
# ?df.reset_index
print(df3)
print(df3.loc['일'])
#df3.iloc['일'] --> 인덱스와 명칭

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업
name    홍길동
age      22
dept     컴공
Name: 일, dtype: object

In [20]:
# 7 인덱스와 2 인덱스 데이타 추출
df.loc[[7,2]]
# name 과 dept 데이터 추출
df[['name','dept']]

  name dept
7  이길동   컴공
0  홍길동   수학
2  김길동   산수
5  배길동   인문
1  박길동   통계

In [21]:
# 특정 컬럼으로 인덱스를 지정
# df.set_index('name') # 원본 수정 하지 않음
# df

# df2 = df2.set_index('name') # 전문가들은 이 방식 권장 바로 원본 수정 노노
# df2

# df.set_index('name',inplace=True)
# df

### 정렬과 T

In [23]:
# 나이를 오름차순으로
# df.sort_index(ascending=0)   # 인덱스 정렬 기본값이 ascending=1
df2 = df.sort_index(ascending=1)
df2
# - sort_index()

# - sort_values()



# 전문가들은 원본이 변경하지 않는 것을 권장

  name  age dept gender  age+10
0  홍길동   22   수학     여자      32
1  박길동   33   통계     님지      43
2  김길동   44   산수     여자      54
5  배길동   55   인문     남자      65
7  이길동   77   컴공     여자      87

### 정보확인

In [ ]:
# 총 데이터 건수와 데이타 타입등 정보 확인

In [ ]:
# 기본통계량 구하기 ( 총개수, 평균, 표준편차, 최소값, 4분위수 등)